const js = import("../pkg/hello_wasm.js");
js.then(js => {
  window.js = js;
  js.add_index();
  console.log(js.get_index());
});

setTimeout(() => {
  const js = import("../pkg/hello_wasm.js")
  js.then(js => {
    window.js = js;
    // setTimeout(() => {
    //   js.add_index();
    // })
    js.add_index();
    console.log(js.get_index());
    js.add_index();
  });
}, 2000);

// js.then(js => {
//   js.add_index();
//   js.add_index();
//   let result = JSON.parse(js.get_index());
//   console.log(result[0], result[0][1], result[0][0] + result[0][1]);
//   console.log(js.get_index());
//
//   let id = js.hello_thread_local();
//   console.log('id:', id);
//   let id2 = js.hello_thread_local();
//   console.log('id:', id2);
// });

// function web_bench() {
//   let container = document.getElementById("container");
//   let begin = Date.now();
//   for(let i = 0; i < 10000; i += 1) {
//     let str = "1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" +
//       "123456789012345678901234567890123456abcd123456789012345678901234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789012345678哈哈1234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789哈哈2345678901234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" +
//       "1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" +
//       "123456789012345678901234567890123456789012345678901234567890123嘻嘻67890123456789012345678901234567890" +
//       "12345678901234567890123456789012345678901234哈哈哈012345678901234567890123456789012345678901234567890";
//
//     let p = document.createElement("p");
//     p.innerHTML = str;
//     container.appendChild(p);
//   }
//   let time = Date.now() - begin;
//   console.log('cost time:', time);
// }
// web_bench();